---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryColorPower
source: html/21489b4b-160d-5291-dd73-10d5ffea80a9.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryColorPower Property

The property labeled "Power to compute secondary highlight color" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodSecondaryColorPower { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".